# parameters
nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0

   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, Conv, [64, 3, 1]],

   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4
   [-1, 1, Yolov7_E_ELAN_PC, [256, 64]], # 4

   [-1, 1, V7DownSampling, [128]],  # 5-P3/8
   [-1, 1, Yolov7_E_ELAN_PC, [512, 128]], # 6

   [-1, 1, V7DownSampling, [256]],  # 7-P4/16
   [-1, 1, Yolov7_E_ELAN_PC, [1024, 256]], # 8

   [-1, 1, V7DownSampling, [512]],  # 9-P5/32
   [-1, 1, Yolov7_E_ELAN_PC_ATT, [1024, 256]],
  ]

# yolov7 head
head:
  [[-1, 1, PSPPCSPC, [512]], # 11-Yolov7-tiny-spp
   [[4, 6, 8, 11], 1, SimFusion_4in, []], # 12
   [-1, 1, IFM, [[64, 32]]], # 13
   
   [11, 1, Conv, [1024, 1, 1]], # 14
   [[6, 8, -1], 1, SimFusion_3in, [256]], # 15
   [[-1, 13], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 0]], # 16
   [-1, 1, Yolov7_E_ELAN_PC, [256, 128]], # 17

   [8, 1, Conv, [128, 1, 1]], # 18
   [[4, 6, -1], 1, SimFusion_3in, [128]], # 19
   [[-1, 13], 1, InjectionMultiSum_Auto_pool, [128, [64, 32], 1]], # 20
   [-1, 1, Yolov7_E_ELAN_PC, [128, 64]], # 21

   [[21, 17, 11], 1, PyramidPoolAgg, [352, 2]], # 22
   [-1, 1, TopBasicLayer, [352, [64, 128]]], # 23

   [[21, 18], 1, AdvPoolFusion, []], # 24
   [[-1, 23], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 0]], # 25
   [-1, 1, Yolov7_E_ELAN_PC, [256, 128]], # 26

   [[-1, 14], 1, AdvPoolFusion, []], # 27
   [[-1, 23], 1, InjectionMultiSum_Auto_pool, [512, [64, 128], 1]], # 28
   [-1, 1, Yolov7_E_ELAN_PC, [512, 256]], # 29

   [[6, 8, 10], 1, ScalSeq, [128]], #30 args[inchane]
   [[21, -1], 1, attention_model, []], #31

   [26,1,EMA,[256]],#32
   [29,1,EMA,[512]],#33

   [31, 1, RepConv, [256, 3, 1]], # 34-P3
   [32, 1, RepConv, [512, 3, 1]], # 35-P4
   [33, 1, RepConv, [1024, 3, 1]], # 36-P5

   [[34,35, 36], 1, IDetect, [nc, anchors]] # 38
  ]